tests/org.jboss.tools.bpel.ui.bot.test/projects/ScopeProcess/messages/ok.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exam="http://www.jboss.org/bpel/examples">
   <soapenv:Header/>
   <soapenv:Body>
      <exam:processRequest>
         <payload>
            <simulateException>false</simulateException>
            <compensate>false</compensate>
         </payload>
      </exam:processRequest>
   </soapenv:Body>
</soapenv:Envelope>
